{
  "bollywood": {
    "circuit": "Munna Bhai's loyal right hand. Known for his black kurta and gold chain. Always ready with a 'Bhai, tension nahi lene ka'.",
    "mogambo": "The villain who was very happy. He wore a blonde wig and a strange costume. His catchphrase is legendary in Indian cinema.",
    "gabbar": "The dacoit who asked 'Kitne aadmi the?'. Terrorized Ramgarh from his rocky hideout. His laughter still echoes in the ravines.",
    "basanti": "She talks non-stop and drives a tonga. Veeru's love interest who danced on glass. Don't ask her name, just call her by her profession.",
    "ddlj": "The longest-running romance in Maratha Mandir. Raj and Simran's train journey changed everything. 'Jaa Simran jaa' is the iconic line.",
    "babubhaiya": "The landlord with the thick glasses and dhoti. Always fighting with Raju and Shyam. 'Utha le re baba' is his desperate prayer.",
    "gogo": "The crime master who is Mogambo's nephew. He plays with marbles and demands his cape back. 'Aaya hoon toh kuch toh leke jaunga'.",
    "majnubhai": "The painting genius who loves horses. Uday Shetty's partner in crime and comedy. He wants to be a serious don but ends up painting.",
    "udayshetty": "The control freak don with a limp. He wants to get his sister married into a decent family. 'Control Uday, control' is his mantra.",
    "vasooli": "The guy who comes to collect money. Big guy, small brain, always gets tricked. Part of the Golmaal crew.",
    "khiladi": "Akshay Kumar's action avatar. He performs his own stunts and breaks bones. The definitive action hero of the 90s.",
    "shahenshah": "The vigilante with the iron arm. By day he is a corrupt cop, by night a savior. 'Rishte mein toh hum tumhare baap lagte hain'.",
    "don": "The police from 11 countries are looking for him. Catching him is not just difficult, it's impossible. He likes his wild cats and his enemies close.",
    "karanarjun": "Two brothers who reincarnated to take revenge. Their mother waited for them for years. 'Mere Karan Arjun aayenge' was the prophecy.",
    "munni": "She became infamous for her dance number. Zandu Balm was mentioned in her song. A massive hit item number from Dabangg."
  },
  "bombay": {
    "vadapav": "The burger of Mumbai. A potato fritter inside a soft bun with chutney. The city runs on this cheap and tasty fuel.",
    "marinedrive": "The Queen's Necklace. A C-shaped boulevard along the coast. Perfect for late-night drives and sitting by the sea.",
    "localtrain": "The lifeline of the city. It's crowded, sweaty, but gets you there. Virar Fast is a daily battle for survival.",
    "dabbawala": "The lunchbox delivery network with Six Sigma accuracy. They deliver home-cooked food to offices. Prince Charles met them.",
    "gateway": "The monument built for a King's visit. It stands facing the Arabian Sea. The Taj Hotel is right next to it.",
    "chorbazaar": "The market of thieves. You might find your own stolen shoes here. A treasure trove for antiques and vintage items.",
    "colaba": "The touristy southern tip of the city. Home to Leopold Cafe and street shopping. A mix of old colonial charm and modern buzz.",
    "bandstand": "The promenade where Shah Rukh Khan lives. Couples sit on the rocks facing the sea. A popular spot for star gazing.",
    "autorickshaw": "The three-wheeled king of the suburbs. They will refuse to go where you want. 'Meter down' is a rare luxury.",
    "cuttingchai": "Half a glass of strong, sweet tea. The fuel for every conversation and break. Served in small glasses at every tapri.",
    "monsoon": "When the city stops and the rains take over. Flooded streets, umbrellas, and bhajiyas. The romantic yet chaotic season.",
    "ganpati": "The elephant god's festival. The city dances on the streets for ten days. 'Ganpati Bappa Morya' echoes everywhere.",
    "vts": "The historic railway station, formerly VT. A UNESCO World Heritage site with gothic architecture. The heart of the railway network.",
    "linkroad": "The road connecting the suburbs. Famous for traffic jams and shopping malls. A lifeline for the western suburbs.",
    "sealink": "The bridge over the sea connecting Bandra and Worli. A modern engineering marvel. Saves time but costs a toll."
  },
  "tech": {
    "unicorn": "A startup valued at over a billion dollars. Rare and magical, but becoming common. Every founder's dream status.",
    "funding": "The money juice that keeps startups alive. VC money poured into growth. 'We just closed our Series A'.",
    "bengaluru": "The Silicon Valley of India. Traffic jams and tech parks. Everyone here is building an app or a startup.",
    "cofounder": "The partner who shares the struggle. One builds, the other sells. Finding a good one is harder than marriage.",
    "equity": "A slice of the company pie. Given to employees instead of high salaries. Worthless paper or a lottery ticket?",
    "burnrate": "How fast the money is disappearing. A high one means death is approaching. Keep it low to survive the winter.",
    "mvp": "Minimum Viable Product. The ugliest version that still works. Ship it fast and fix it later.",
    "pivot": "Changing the entire business model. When the original idea fails, you turn. 'We are now an AI company'.",
    "seriesa": "The first big round of venture capital. Now you have to actually grow. The party is over, the work begins.",
    "angelinvestor": "A rich individual who bets on your idea early. They give you the first check. Usually a successful founder themselves.",
    "pitchdeck": "The slides you show to investors. Needs a hockey stick graph. 'We are the Uber for X'.",
    "valuation": "What the investors think your company is worth. A vanity metric for many. 'We are a decacorn now'.",
    "bootstrap": "Building without outside money. Eating ramen and saving every penny. You own 100% but you grow slow.",
    "hiring": "Finding talent is the hardest job. 'We are looking for 10x engineers'. The war for talent is real.",
    "layoff": "The dark side of the tech world. 'Restructuring' the team. A Zoom call you never want to join."
  },
  "internet": {
    "viral": "Spreading like a disease, but in a good way. Everyone is sharing it. 1 million views in an hour.",
    "meme": "A funny image with text that explains life. The language of the internet. Doge, Pepe, and Drake know it well.",
    "troll": "Someone who comments just to annoy you. Don't feed them. They live under the bridge of the internet.",
    "influencer": "They get paid to post photos. 'Link in bio' is their catchphrase. Living the dream life, or faking it?",
    "reel": "Short videos that steal your time. You scroll for one minute, and an hour passes. Dancing trends and life hacks.",
    "hashtag": "The pound sign used to tag topics. #Trending. Helps you find what everyone is talking about.",
    "clickbait": "A headline that lies to you. 'You won't believe what happened next'. Designed to make you click.",
    "algorithm": "The invisible robot that decides what you see. It knows you better than you know yourself. Blame it for your addiction.",
    "cringe": "Second-hand embarrassment. Watching someone try too hard. It makes you want to look away.",
    "follower": "Someone who subscribes to your updates. A metric of popularity. 'I have 10k followers on Insta'.",
    "subscribe": "The button you smash to support a creator. 'Don't forget to like and subscribe'. The bell icon is next.",
    "dm": "Direct Message. Sliding into them requires confidence. 'Check your DMs'.",
    "story": "A photo or video that disappears in 24 hours. A glimpse into daily life. The ring around the profile picture.",
    "thread": "A series of connected tweets. 'A thread 🧵'. Used for long rants or explanations.",
    "ratio": "When the replies are more than the likes. Usually means a bad take. 'L + Ratio'."
  },
  "food": {
    "biryani": "The king of rice dishes. Spiced meat and rice cooked to perfection. Hyderabadi or Lucknowi, the debate never ends.",
    "panipuri": "Crispy balls filled with spicy water. You have to eat it whole. The hygiene is questionable, but the taste is divine.",
    "dosa": "A crispy crepe made from fermented batter. Served with sambar and chutney. A South Indian staple loved everywhere.",
    "samosa": "A triangular pastry filled with spiced potatoes. The perfect tea-time snack. Best eaten hot with chutney.",
    "butterchicken": "Chicken cooked in a creamy tomato sauce. Invented in Delhi. The global ambassador of Indian food.",
    "momos": "Steamed dumplings from the Himalayas. Served with spicy red chutney. Delhi's favorite street food.",
    "jalebi": "A spiral sweet soaked in sugar syrup. Crispy, sticky, and orange. often eaten with fafda or rabri.",
    "chai": "Tea boiled with milk, sugar, and spices. Not 'Chai Tea', just Chai. The solution to every headache.",
    "lassi": "A thick yogurt drink, sweet or salty. Often topped with cream (malai). A heavy glass puts you to sleep.",
    "pavbhaji": "Mashed vegetables cooked in butter. Served with buttered bread rolls. A Mumbai street food classic.",
    "cholebhature": "Spicy chickpeas with fried bread. A heavy breakfast from Punjab. You need a nap after this.",
    "rasgulla": "Spongy white balls soaked in syrup. A Bengali sweet made from chhena. Squeaky and sweet.",
    "gulabjamun": "Deep-fried milk solids soaked in syrup. The classic Indian dessert. Warm and soft, melts in your mouth.",
    "maggi": "Instant noodles that take 2 minutes (lies). The midnight snack of every student. Everyone has their own recipe.",
    "thali": "A platter with a little bit of everything. Roti, rice, dal, sabzi, sweet. The complete meal experience."
  }
}